<a href="https://colab.research.google.com/github/annagradziel12/Pandas/blob/master/Pandas_MovieLens.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.read_csv("ml-1m/movies.dat", sep="::", engine="python", header=None)

         0                                   1                             2
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy
...    ...                                 ...                           ...
3878  3948             Meet the Parents (2000)                        Comedy
3879  3949          Requiem for a Dream (2000)                         Drama
3880  3950                    Tigerland (2000)                         Drama
3881  3951             Two Family House (2000)                         Drama
3882  3952               Contender, The (2000)                Drama|Thriller

[3883 rows x 3 columns]

In [ ]:
pd.read_csv("ml-1m/movies.dat", sep="::",
            engine="python", names=["MovieID", "Title", "Genres"])

,MovieID,Title,Genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

# Dygresja o odwoływaniu się do multiindeksu, do wiersza

Najważniejsza sprawa: odwoływać się krotką.

In [ ]:
ramka2 = pd.DataFrame({"A" : np.round(np.random.uniform(0, 1, 6), 2),
                      "B" : np.round(np.random.uniform(0, 1, 6), 2)})
ramka2
ramka2.index = pd.MultiIndex(levels=[["x", "y", "z"], [1,2,3,4]], # jakie są dostępne poziomy
                            codes = [[0,0,0,1,1,2], [0,1,3,0,1,2]],
                            names=["i1", "i2"])
ramka2

          A     B
i1 i2
x  1   0.30  0.53
   2   0.82  0.27
   4   0.41  0.13
y  1   0.41  0.28
   2   0.60  0.30
z  3   0.35  0.25

In [ ]:
ramka2.loc[("y",1), "A"]

0.41

In [ ]:
ramka2.loc["y", "A"]

i2
1    0.41
2    0.60
Name: A, dtype: float64

# Wracamy do wczytywania

In [ ]:
movies = pd.read_csv("ml-1m/movies.dat", sep="::",
            engine="python", names=["MovieID", "Title", "Genres"])
users = pd.read_csv("ml-1m/users.dat", sep="::",
            engine="python", names=["UserID", "Gender", "Age", "Occupation", "Zip-code"])
ratings = pd.read_csv("ml-1m/ratings.dat", sep="::",
            engine="python", names=["UserID", "MovieID", "Rating", "Timestamp"])

In [ ]:
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [ ]:
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [ ]:
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

# Wyciąganie roku produkcji filmu

In [ ]:
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

* slice, wycinanie, ostatnie znaki
* regex, wyrażenie regularne

## Slice

In [ ]:
movies.Title.str.slice(-5, -1).astype(int)

0       1995
1       1995
2       1995
3       1995
4       1995
        ...
3878    2000
3879    2000
3880    2000
3881    2000
3882    2000
Name: Title, Length: 3883, dtype: int64

In [ ]:
movies.Title.str[-5:-1].astype(int)

0       1995
1       1995
2       1995
3       1995
4       1995
        ...
3878    2000
3879    2000
3880    2000
3881    2000
3882    2000
Name: Title, Length: 3883, dtype: int64

In [ ]:
movies.Title.str[:-7]

0                         Toy Story
1                           Jumanji
2                  Grumpier Old Men
3                 Waiting to Exhale
4       Father of the Bride Part II
                   ...
3878               Meet the Parents
3879            Requiem for a Dream
3880                      Tigerland
3881               Two Family House
3882                 Contender, The
Name: Title, Length: 3883, dtype: object

In [ ]:
movies.Title.str[:-6].str.strip()

0                         Toy Story
1                           Jumanji
2                  Grumpier Old Men
3                 Waiting to Exhale
4       Father of the Bride Part II
                   ...
3878               Meet the Parents
3879            Requiem for a Dream
3880                      Tigerland
3881               Two Family House
3882                 Contender, The
Name: Title, Length: 3883, dtype: object

## Regex

In [ ]:
movies.Title.values

array(['Toy Story (1995)', 'Jumanji (1995)', 'Grumpier Old Men (1995)',
       ..., 'Tigerland (2000)', 'Two Family House (2000)',
       'Contender, The (2000)'], dtype=object)

In [ ]:
movies.Title.str.extract(" \((\d{4})\)$").astype(int)

ValueError: cannot convert float NaN to integer

In [ ]:
movies.Title[~movies.Title.str.contains(" \(\d{4}\)$")]

988    Associate, The (L'Associe)(1982)
Name: Title, dtype: object

In [ ]:
movies.Title.str.extract("\((\d{4})\)$").astype(int)

         0
0     1995
1     1995
2     1995
3     1995
4     1995
...    ...
3878  2000
3879  2000
3880  2000
3881  2000
3882  2000

[3883 rows x 1 columns]

In [ ]:
movies.Title.str.replace(" ?\((\d{4})\)$", "").values

array(['Toy Story', 'Jumanji', 'Grumpier Old Men', ..., 'Tigerland',
       'Two Family House', 'Contender, The'], dtype=object)

# Wycinamy rok już naprawdę

In [ ]:
movies["Year"] = movies.Title.str.slice(-5, -1).astype(int)
movies["Title"] = movies.Title.str[:-6].str.strip()

In [ ]:
movies.head()

   MovieID                        Title                        Genres  Year
0        1                    Toy Story   Animation|Children's|Comedy  1995
1        2                      Jumanji  Adventure|Children's|Fantasy  1995
2        3             Grumpier Old Men                Comedy|Romance  1995
3        4            Waiting to Exhale                  Comedy|Drama  1995
4        5  Father of the Bride Part II                        Comedy  1995

# 3. Ile jest wszystkich filmów?

In [ ]:
movies.shape[0]

3883

In [ ]:
len(movies)

3883

# 4. Wykryj i wypisz wszystkie remaki (ten sam tytuł, inny rok produkcji)

* groupby
* duplicated
* value_counts()

## value_counts()

In [ ]:
movies.Title.value_counts().reset_index().query("Title > 1")\
    .rename({"index":"Title", "Title":"Count"}, axis=1)

                                         Title  Count
0                                       Hamlet      5
1                                   Mummy, The      3
2                                Haunting, The      2
3                                      Othello      2
4                              King and I, The      2
5                               101 Dalmatians      2
6                                      Dracula      2
7                                   Get Carter      2
8                          Scarlet Letter, The      2
9                             Parent Trap, The      2
10                        Nutty Professor, The      2
11                                     Sabrina      2
12                            Mighty Joe Young      2
13                              My Man Godfrey      2
14                                   Cape Fear      2
15                             Mis�rables, Les      2
16                                       Loser      2
17                                    Fly, The      2
18                      End of the Affair, The      2
19                                     Titanic      2
20                                  True Crime      2
21                  Man Who Knew Too Much, The      2
22                                      Lolita      2
23                            Jungle Book, The      2
24  Ballad of Narayama, The (Narayama Bushiko)      2
25                    Thomas Crown Affair, The      2
26                                    Kid, The      2
27                       Village of the Damned      2
28                      Miracle on 34th Street      2
29                              That Darn Cat!      2
30                                      Psycho      2
31                                  Wonderland      2
32                           Godzilla (Gojira)      2
33                                   King Kong      2
34                             Doctor Dolittle      2
35                                General, The      2
36                                      Kronos      2
37                                       Shaft      2

In [ ]:
counts = movies.Title.value_counts().reset_index()
counts = counts[counts.Title > 1]
counts.rename({"index":"Title", "Title":"Count"}, axis=1)

                                         Title  Count
0                                       Hamlet      5
1                                   Mummy, The      3
2                                Haunting, The      2
3                                      Othello      2
4                              King and I, The      2
5                               101 Dalmatians      2
6                                      Dracula      2
7                                   Get Carter      2
8                          Scarlet Letter, The      2
9                             Parent Trap, The      2
10                        Nutty Professor, The      2
11                                     Sabrina      2
12                            Mighty Joe Young      2
13                              My Man Godfrey      2
14                                   Cape Fear      2
15                             Mis�rables, Les      2
16                                       Loser      2
17                                    Fly, The      2
18                      End of the Affair, The      2
19                                     Titanic      2
20                                  True Crime      2
21                  Man Who Knew Too Much, The      2
22                                      Lolita      2
23                            Jungle Book, The      2
24  Ballad of Narayama, The (Narayama Bushiko)      2
25                    Thomas Crown Affair, The      2
26                                    Kid, The      2
27                       Village of the Damned      2
28                      Miracle on 34th Street      2
29                              That Darn Cat!      2
30                                      Psycho      2
31                                  Wonderland      2
32                           Godzilla (Gojira)      2
33                                   King Kong      2
34                             Doctor Dolittle      2
35                                General, The      2
36                                      Kronos      2
37                                       Shaft      2

## groupby

In [ ]:
movies.groupby("Title").size().reset_index().rename({0:"Count"}, axis=1).query("Count>1").shape

(38, 2)

## duplicated

In [ ]:
movies.Title[movies.Title.duplicated()].reset_index().drop("index", axis=1)

                                         Title
0                                      Sabrina
1                          Scarlet Letter, The
2                                    Cape Fear
3                               That Darn Cat!
4                              Mis�rables, Les
5                                       Hamlet
6                             Parent Trap, The
7                             Jungle Book, The
8                               101 Dalmatians
9                              Doctor Dolittle
10                        Nutty Professor, The
11                  Man Who Knew Too Much, The
12                           Godzilla (Gojira)
13                                   King Kong
14                                      Psycho
15                      Miracle on 34th Street
16                            Mighty Joe Young
17                                    Fly, The
18  Ballad of Narayama, The (Narayama Bushiko)
19                       Village of the Damned
20                                  True Crime
21                             King and I, The
22                                  Mummy, The
23                                  Mummy, The
24                                     Dracula
25                               Haunting, The
26                                      Lolita
27                    Thomas Crown Affair, The
28                                      Hamlet
29                                     Othello
30                                General, The
31                              My Man Godfrey
32                      End of the Affair, The
33                                     Titanic
34                                      Hamlet
35                                       Loser
36                                      Hamlet
37                                       Shaft
38                                    Kid, The
39                                  Wonderland
40                                      Kronos
41                                  Get Carter

# 5. Kontynuacja poprzedniego, o remakach: jaki film ma największą odległość od najstarszej wersji do najnowszej?

In [ ]:
movies.groupby("Title")["Year"].agg(["min", "max"])["min"] # najlepiej po prostu uniknąć problem

Title
$1,000,000 Duck                        1971
'Night Mother                          1986
'Til There Was You                     1997
'burbs, The                            1989
...And Justice for All                 1979
                                       ...
Zero Effect                            1998
Zero Kelvin (Kj�rlighetens kj�tere)    1995
Zeus and Roxanne                       1997
Zone 39                                1997
eXistenZ                               1999
Name: min, Length: 3841, dtype: int64

In [ ]:
remaki = movies.groupby("Title").agg({"Year": ["min", "max"]})
remaki[("Year", "min")]
remaki[("Year", "max")]

Title
$1,000,000 Duck                        1971
'Night Mother                          1986
'Til There Was You                     1997
'burbs, The                            1989
...And Justice for All                 1979
                                       ...
Zero Effect                            1998
Zero Kelvin (Kj�rlighetens kj�tere)    1995
Zeus and Roxanne                       1997
Zone 39                                1997
eXistenZ                               1999
Name: (Year, max), Length: 3841, dtype: int64

In [ ]:
remaki["Range"] = remaki[("Year", "max")] - remaki[("Year", "min")]

In [ ]:
remaki.sort_values(by="Range", ascending=False)

                        Year       Range
                         min   max
Title
Kid, The                1921  2000    79
General, The            1927  1998    71
Scarlet Letter, The     1926  1995    69
Mummy, The              1932  1999    67
Hamlet                  1948  2000    52
...                      ...   ...   ...
Freejack                1992  1992     0
Freeway                 1996  1996     0
French Connection, The  1971  1971     0
French Kiss             1995  1995     0
eXistenZ                1999  1999     0

[3841 rows x 3 columns]

# 5a. Wypisać remaki, interesuje nas tytuł i rok, mają być koło siebie, posortowane od najmłodszego do najstarszego remaka

```
Hamlet 2003
Hamlet 1995
Hamlet 1965
Sabrina 2001
Sabrina 1999
```

In [ ]:
sort_values
duplicated

In [ ]:
movies[["Title", "Year"]][movies.Title.duplicated(keep=False)]\
    .sort_values(["Title", "Year"], ascending=[True, False])

                                           Title  Year
1346                              101 Dalmatians  1996
2016                              101 Dalmatians  1961
2443  Ballad of Narayama, The (Narayama Bushiko)  1982
843   Ballad of Narayama, The (Narayama Bushiko)  1958
1322                                   Cape Fear  1991
...                                          ...   ...
686                                   True Crime  1995
328                        Village of the Damned  1995
2484                       Village of the Damned  1960
3753                                  Wonderland  1999
1611                                  Wonderland  1997

[80 rows x 2 columns]

# 5b. Wybieramy cały rekord dotyczący filmu będącego remakiem, ale za każdym razem tylko najmłodszy

```
Hamlet 2003 Drama|Historyczny
Sabrina 2001 Fantasy|Teen
```

In [ ]:
movies[movies.Title.duplicated(keep=False)]\
    .sort_values(["Title", "Year"], ascending=[True, False]).drop_duplicates(subset="Title", keep="first").shape

(38, 4)

In [ ]:
movies[movies.Title.sort_values(["Title", "Year"], ascending=[True, False])

In [ ]:
movies.sort_values(["Title", "Year"], ascending=[True, False])\
    .reset_index(drop=True)[movies.Title.duplicated(keep="first")].shape

(42, 4)

# 6. Ile filmów powstało w poszczególnych latach

* groupby
* value_counts()

In [ ]:
movies.Year.value_counts().reset_index()

    index  Year
0    1996   345
1    1995   342
2    1998   337
3    1997   315
4    1999   283
..    ...   ...
76   1923     3
77   1929     3
78   1922     2
79   1920     2
80   1921     1

[81 rows x 2 columns]

In [ ]:
movies.groupby("Year").size().reset_index()

    Year    0
0   1919    3
1   1920    2
2   1921    1
3   1922    2
4   1923    3
..   ...  ...
76  1996  345
77  1997  315
78  1998  337
79  1999  283
80  2000  156

[81 rows x 2 columns]

# 7. Jak wygląda rozkład płci oraz grup wiekowych wśród użytkowników (zarówno jednowymiarowo, jak i dwuwymiarowo). Jednym wywołaniem!

In [ ]:
crosstab

margins

In [ ]:
pd.crosstab(users.Gender, users.Age, margins=True, margins_name="Wszystko")

Age         1    18    25    35   45   50   56  Wszystko
Gender
F          78   298   558   338  189  146  102      1709
M         144   805  1538   855  361  350  278      4331
Wszystko  222  1103  2096  1193  550  496  380      6040

In [ ]:
pd.crosstab(users.Gender, users.Age, margins=True, margins_name="Wszystko", normalize="all")

Age,1,18,25,35,45,50,56,Wszystko
Gender,,,,,,,,
F,0.012914,0.049338,0.092384,0.055960,0.031291,0.024172,0.016887,0.282947
M,0.023841,0.133278,0.254636,0.141556,0.059768,0.057947,0.046026,0.717053
Wszystko,0.036755,0.182616,0.347020,0.197517,0.091060,0.082119,0.062914,1.000000

In [ ]:
pd.crosstab(users.Gender, users.Age, margins=True, margins_name="Wszystko", normalize="index")

Age             1         18        25        35        45        50        56
Gender
F         0.045641  0.174371  0.326507  0.197776  0.110591  0.085430  0.059684
M         0.033249  0.185869  0.355114  0.197414  0.083353  0.080813  0.064188
Wszystko  0.036755  0.182616  0.347020  0.197517  0.091060  0.082119  0.062914

In [ ]:
pd.crosstab(users.Gender, users.Age, margins=True, margins_name="Wszystko", normalize="columns")

Age,1,18,25,35,45,50,56,Wszystko
Gender,,,,,,,,
F,0.351351,0.270172,0.266221,0.283319,0.343636,0.294355,0.268421,0.282947
M,0.648649,0.729828,0.733779,0.716681,0.656364,0.705645,0.731579,0.717053

# 8. Jaki gatunek filmowy jest najczęstszy

Dla wpisu `Animation|Children's|Comedy` podbijamy:
* Animation +1
* Children's +1
* Comedy +1

In [ ]:
movies.head()

   MovieID                        Title                        Genres  Year
0        1                    Toy Story   Animation|Children's|Comedy  1995
1        2                      Jumanji  Adventure|Children's|Fantasy  1995
2        3             Grumpier Old Men                Comedy|Romance  1995
3        4            Waiting to Exhale                  Comedy|Drama  1995
4        5  Father of the Bride Part II                        Comedy  1995

In [ ]:
split()

# może przejść z formy szerokiej do długiej?

In [ ]:
movies.Genres.str.split("|")

0        [Animation, Children's, Comedy]
1       [Adventure, Children's, Fantasy]
2                      [Comedy, Romance]
3                        [Comedy, Drama]
4                               [Comedy]
                      ...
3878                            [Comedy]
3879                             [Drama]
3880                             [Drama]
3881                             [Drama]
3882                   [Drama, Thriller]
Name: Genres, Length: 3883, dtype: object

# Podejście 1

In [ ]:
movies.Genres.str.split("|", expand=True).stack().value_counts()

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Western          68
Fantasy          68
Film-Noir        44
dtype: int64

# Podejście 1b (awaryjne)

In [ ]:
pd.Series(movies.Genres.str.split("|", expand=True).values.flatten()).value_counts()

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Western          68
Fantasy          68
Film-Noir        44
dtype: int64

## Podejście 2

```
Blondyn
Brunet
Blondyn
Szatyn
```

n to liczba możliwych poziomów, tu 3

n kolumn:
```
Szatyn Blondyn Brunet
0      1       0
0      0       1
0      1       0
1      0       0
```

sprytniej (n-1 kolumn):
```
Blondyn  Brunet
      1       0
      0       1
      1       0
      0       0
```

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.get_dummies.html

In [ ]:
movies.Genres.str.get_dummies() # sep="|" jest domyślnie, można ustawić inny

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [ ]:
movies.Genres.str.get_dummies().sum().sort_values(ascending=False).reset_index()

          index     0
0         Drama  1603
1        Comedy  1200
2        Action   503
3      Thriller   492
4       Romance   471
5        Horror   343
6     Adventure   283
7        Sci-Fi   276
8    Children's   251
9         Crime   211
10          War   143
11  Documentary   127
12      Musical   114
13      Mystery   106
14    Animation   105
15      Western    68
16      Fantasy    68
17    Film-Noir    44

# 9. Jaki jest najlepszy film wszechczasów, (najlepszy, czyli ma najwyższą średnią ocenę) - to zadanie możesz rozwiązać wykonując złączenie (join) zbioru movies i ratings

In [ ]:
movies.head()

   MovieID                        Title                        Genres  Year
0        1                    Toy Story   Animation|Children's|Comedy  1995
1        2                      Jumanji  Adventure|Children's|Fantasy  1995
2        3             Grumpier Old Men                Comedy|Romance  1995
3        4            Waiting to Exhale                  Comedy|Drama  1995
4        5  Father of the Bride Part II                        Comedy  1995

In [ ]:
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [ ]:
oceny = ratings.groupby("MovieID")["Rating"].mean().reset_index()
filmy_oceny = pd.merge(oceny, movies)

In [ ]:
filmy_oceny.sort_values(by="Rating", ascending=False).head(20)

,MovieID,Rating,Title,Genres,Year
926,989,5.000000,Schlafes Bruder (Brother of Sleep),Drama,1995
3635,3881,5.000000,Bittersweet Motel,Documentary,2000
1652,1830,5.000000,Follow the Bitch,Comedy,1998
3152,3382,5.000000,Song of Freedom,Drama,1936
744,787,5.000000,"Gate of Heavenly Peace, The",Documentary,1995
3054,3280,5.000000,"Baby, The",Horror,1973
3367,3607,5.000000,One Little Indian,Comedy|Drama|Western,1973
3010,3233,5.000000,Smashing Time,Comedy,1967
2955,3172,5.000000,Ulysses (Ulisse),Adventure,1954
3414,3656,5.000000,Lured,Crime,1947
3021,3245,4.800000,I Am Cuba (Soy Cuba/Ya Kuba),Drama,1964
51,53,4.750000,Lamerica,Drama,1994
2309,2503,4.666667,"Apple, The (Sib)",Drama,1998
2698,2905,4.608696,Sanjuro,Action|Adventure,1962
1839,2019,4.560510,Seven Samurai (The Magnificent Seven) (Shichin...,Action|Drama,1954
309,318,4.554558,"Shawshank Redemption, The",Drama,1994
802,858,4.524966,"Godfather, The",Action|Crime|Drama,1972
708,745,4.520548,"Close Shave, A",Animation|Comedy|Thriller,1995
49,50,4.517106,"Usual Suspects, The",Crime|Thriller,1995
513,527,4.510417,Schindler's List,Drama|War,1993

In [ ]:
filmy_oceny2 = pd.merge(movies, oceny, how="left") # filmy bez ocen
filmy_oceny2[pd.isnull(filmy_oceny2.Rating)]

,MovieID,Title,Genres,Year,Rating
50,51,Guardian Angel,Action|Drama|Thriller,1994,NaN
107,109,Headless Body in Topless Bar,Comedy,1995,NaN
113,115,Happiness Is in the Field,Comedy,1995,NaN
141,143,Gospa,Drama,1995,NaN
281,284,New York Cop,Action|Crime,1996,NaN
...,...,...,...,...,...
3581,3650,Anguish (Angustia),Horror,1986,NaN
3681,3750,Boricua's Bond,Drama,2000,NaN
3759,3829,Mad About Mambo,Comedy|Romance,2000,NaN
3786,3856,Autumn Heart,Drama,1999,NaN
3837,3907,"Prince of Central Park, The",Drama,1999,NaN

# 10. Wykonaj poprzedni punkt, odrzucając wcześniej filmy które nie uzyskały wystarczająco dużo głosów (np 100)

In [ ]:
oceny = ratings.groupby("MovieID")["Rating"].agg(["mean", "size"]).reset_index().query("size >= 100")
filmy_oceny = pd.merge(oceny, movies).sort_values(by="mean", ascending=False)
filmy_oceny.head(20)

,MovieID,mean,size,Title,Genres,Year
1021,2019,4.560510,628,Seven Samurai (The Magnificent Seven) (Shichin...,Action|Drama,1954
173,318,4.554558,2227,"Shawshank Redemption, The",Drama,1994
416,858,4.524966,2223,"Godfather, The",Action|Crime|Drama,1972
377,745,4.520548,657,"Close Shave, A",Animation|Comedy|Thriller,1995
39,50,4.517106,1783,"Usual Suspects, The",Crime|Thriller,1995
294,527,4.510417,2304,Schindler's List,Drama|War,1993
568,1148,4.507937,882,"Wrong Trousers, The",Animation|Comedy,1993
447,922,4.491489,470,Sunset Blvd. (a.k.a. Sunset Boulevard),Film-Noir,1950
591,1198,4.477725,2514,Raiders of the Lost Ark,Action|Adventure,1981
430,904,4.476190,1050,Rear Window,Mystery|Thriller,1954
576,1178,4.473913,230,Paths of Glory,Drama|War,1957
142,260,4.453694,2991,Star Wars: Episode IV - A New Hope,Action|Adventure|Fantasy|Sci-Fi,1977
604,1212,4.452083,480,"Third Man, The",Mystery|Thriller,1949
379,750,4.449890,1367,Dr. Strangelove or: How I Learned to Stop Worr...,Sci-Fi|War,1963
367,720,4.426941,438,Wallace & Gromit: The Best of Aardman Animation,Animation,1996
599,1207,4.425647,928,To Kill a Mockingbird,Drama,1962
1781,3435,4.415608,551,Double Indemnity,Crime|Film-Noir,1944
438,912,4.412822,1669,Casablanca,Drama|Romance|War,1942
1451,2762,4.406263,2459,"Sixth Sense, The",Thriller,1999
1587,3030,4.404651,215,Yojimbo,Comedy|Drama|Western,1961

# 11. Jaki jest najlepszy film według kobiet i według mężczyzn (zachowując warunek w ten sposób, że musi być co najmniej 100 kobiet żeby liczył się w grupie kobiet, i co najmniej 100 mężczyzn, żeby się liczył w grupie mężczyzn)

In [ ]:
oceny = pd.merge(ratings, users)[["UserID", "MovieID", "Rating", "Gender"]]
oceny_srednie = oceny.groupby(["MovieID", "Gender"])["Rating"].agg(["mean", "size"])\
    .reset_index().query("size>100")
oceny_srednie

      MovieID Gender      mean  size
0           1      F  4.187817   591
1           1      M  4.130552  1486
2           2      F  3.278409   176
3           2      M  3.175238   525
4           3      F  3.073529   136
...       ...    ...       ...   ...
7142     3948      F  3.619048   231
7143     3948      M  3.641838   631
7145     3949      M  4.174107   224
7150     3952      F  3.761905   105
7151     3952      M  3.787986   283

[2560 rows x 4 columns]

Padło pytanie: a gdyby chcieć zrobić warunek, że dopuszczamy film jeśli jednocześnie ma 100 głosów wśród mężczyzn i kobiet. Zrobimy tak: pogrupujemy i wybierzemy minimum. To minimum powinno być większe niż 100.

In [ ]:
do_odrzucenia = oceny_srednie.groupby("MovieID")["size"].min()
do_odrzucenia = do_odrzucenia[do_odrzucenia < 500] # powinno być 100, ale takich filmów nie ma, więc dla testu robimy 500
do_odrzucenia

MovieID
2       176
3       136
5       108
6       129
7       204
       ...
3932    188
3937    125
3948    231
3949    224
3952    105
Name: size, Length: 1710, dtype: int64

In [ ]:
oceny_srednie[~oceny_srednie.MovieID.isin(do_odrzucenia.index)]

      MovieID Gender      mean  size
0           1      F  4.187817   591
1           1      M  4.130552  1486
65         34      F  3.953368   579
66         34      M  3.860922  1172
184        95      M  2.900000   540
...       ...    ...       ...   ...
5531     3070      M  3.402321   517
6559     3638      M  3.203833   574
6670     3697      M  2.888702   593
6672     3698      M  3.211094   649
6755     3740      M  3.485030   501

[81 rows x 4 columns]

Wracamy do zadania:

In [ ]:
pd.merge(movies, oceny_srednie).sort_values(by="mean",ascending=False)\
    .drop_duplicates(subset="Gender", keep="first")

,MovieID,Title,Genres,Year,Gender,mean,size
474,745,"Close Shave, A",Animation|Comedy|Thriller,1995,F,4.644444,180
521,858,"Godfather, The",Action|Crime|Drama,1972,M,4.583333,1740

# 12. Jaki jest średni rok oglądanego filmu w poszczególnych grupach wiekowych

In [ ]:
ratings_users_movies = pd.merge(pd.merge(users, ratings), movies)
ratings_users_movies.groupby("Age")["Year"].mean()

Age
1     1988.981699
18    1989.701982
25    1987.972972
35    1984.965478
45    1983.500520
50    1982.483211
56    1981.549097
Name: Year, dtype: float64

# 13. Progress bar

(w terminalu) pip install tqdm --upgrade

(w jupyterze) !pip install tqdm --upgrade

In [ ]:
from tqdm.notebook import tqdm

In [ ]:
for i in tqdm(range(15)):
    n = 4000
    a = np.random.uniform(0,1,(n, n))
    b = np.random.uniform(0,1,(n, n))
    c = a @ b

HBox(children=(IntProgress(value=0, max=15), HTML(value='')))

In [ ]:
from tqdm import tqdm

In [ ]:
for i in tqdm(range(15)):
    n = 4000
    a = np.random.uniform(0,1,(n, n))
    b = np.random.uniform(0,1,(n, n))
    c = a @ b

100%|██████████| 15/15 [01:00<00:00,  4.03s/it]